function outsys = dornier328 ()
% Модель бокового каналу літака Dornier Do 328
% Режим крейсерського польоту
% V = 144 m/s
% H = 900 m
% крен = 0 deg
% Входи
% (1) - відхилення елеронів
% (2) - відхілення руля напряму
% Виходи
% (1) - кутова швидкість рискання
% (2) - кут крену
% Стани
% (1) - кутова швидкість рискання
% (2) - кут ковзання
% (3) - кутова швидкість крену
% (4) - кут крену

  if (nargin ~= 0)
    print_usage ();
  end
  a = [-0.8700,  6.4700, -0.4110, 0.0;
       -1.0000, -0.3760,  0.0,    0.0681;
        0.9130, -18.800, -3.9100, 0.0;
        0.0,     0.0,     1.0,    0.0];

  b = [-0.8770, -7.78;
        0.0,     0.12;
       -14.300,  3.74;
        0.0,      0.0];

  c = [1.0, 0.0, 0.0, 0.0;
       0.0, 0.0, 0.0, 1.0];

  d = zeros (2, 2);

  inam = {"aileron"; "rudder"};
  onam = {"yawspd"; "roll"};

  outsys = ss (a, b, c, d, 'InputName', inam, 'OutputName', onam);

end
